chronoweb/src/main/resources/webroot/example/getVocabulariesXML/SimpleMasterDataQuery/HASATTR.xml

<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:query="urn:epcglobal:epcis-query:xsd:2"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<soapenv:Header />
	<soapenv:Body>
		<query:Poll>
			<queryName>SimpleMasterDataQuery</queryName>
			<params>
				<!-- includeAttributes and includeChidren are mandatory parameters -->
				<param>
					<name>includeAttributes</name>
					<value xsi:type="xsd:boolean">true</value>
				</param>
				<param>
					<name>includeChildren</name>
					<value xsi:type="xsd:boolean">true</value>
				</param>
				<param>
					<name>HASATTR</name>
					<value xsi:type="query:ArrayOfString">
						<string>urn:epcglobal:cbv:mda#countryOfOrigin</string>
						<string>urn:epcglobal:cbv:mda#descriptionShort</string>
					</value>
				</param>
			</params>
		</query:Poll>
	</soapenv:Body>
</soapenv:Envelope>